[
  {
    "Id": "478224",
    "ThreadId": "222962",
    "Html": "<p>My developers/team has a really hard time understanding branching and merging and no matter how many times I print out the branching guidance document/diagrams (which are indeed pretty) my developers keep saying that branching is hard, using labels with branching is complicated, and using the branch visualizations/track changeset doesn't make sense. I've been working with them on our branching structure and at times I&nbsp;too seem to get lost in the&nbsp;features....and don't fully&nbsp;remember&nbsp;the WHY behind what we're doing&nbsp;in the tool. A quick re-reading of the guidance helps...but it sure would be nice&nbsp;to&nbsp;have a practical example that my developers&nbsp;can have in their visual studio environment.</p>\r\n<p>If you guys&nbsp;could&nbsp;create a Feature&nbsp;Builder lab that would&nbsp;be great. Heck even starting from the Create Team&nbsp;Project step all the way through to merge resolution would be even better.</p>\r\n<p>And possibly could you explain why you would use the&nbsp;create branch from existing source control option in the Team Project&nbsp;creation wizard...that'd be nice as well.</p>\r\n<p>Thanks for the guidance so far...it's saved our bacon more than once....just hoping to see&nbsp;even more practical&nbsp;training on TFS 2010.&nbsp;</p>\r\n<div id=\"_mcePaste\" style=\"width:1px;height:1px;overflow:hidden;top:0px;left:-10000px\">﻿</div>",
    "PostedDate": "2010-08-09T10:40:50.807-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "482131",
    "ThreadId": "222962",
    "Html": "<p>Is this idea under any consideration to be added to the next release of the guidance?</p>",
    "PostedDate": "2010-08-18T19:50:35.72-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "482237",
    "ThreadId": "222962",
    "Html": "<p>Allen,</p>\r\n<p>With respect to to providing guidance and / or a HOL using Feature Builder, I would say that we would consider any delivery modes or formats that will improve the communities ability to consume and beneft from the guidance. I cannot, however, commit to any specific format without discussing this with the leadership of the VS ALM Rangers program. One of the goals, when we undertake a Ranger project, is to make it easy for people to contribute. We have found the Word format (with PDF and XPS options) to be a reasonable publishing format for codeplex. I am continuing to look at alternative (additional) formats such as Feature Builder and Compiled Help (CHM) files.</p>\r\n<p>With respect to a suggestion for a lab, the existing guidance contains a downloadable lab and sample files that has been well received. It can be used with any VS TFS 2010 environment (physical or virtual).</p>\r\n<p>I will respond to the rest of your question shortly.</p>\r\n<p>Regards,<br>Bill Heys<br>VS ALM Ranger</p>",
    "PostedDate": "2010-08-19T03:46:37.833-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "486445",
    "ThreadId": "222962",
    "Html": "<p>Bill,</p>\r\n<p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; While I can understand that you can't commit to any specific format without first discussing it with the leadership and the VS ALM Rangers program....it would be nice to see into the process and learn about what in fact is going to be worked on for the next release via the workitems that could be created here on codeplex.</p>\r\n<p>Thanks again for your efforts on this guidance....it really is good....just hoping to see it continue to be developed and improved over time.</p>",
    "PostedDate": "2010-08-30T08:35:31.623-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]