[
  {
    "Id": "1129287",
    "ThreadId": "471231",
    "Html": "I am completely new to branching. I've done some research, which mainly consisted of reading the Branching and Merging Guide and reading several threads in this forum. After that I decided that my team would probably best be served with a Basic plan, since we only write in-house software and are in complete control of the installation process. (I.e., we don't need hotfixes or service packs; we can just recompile an installation package and uninstall/reinstall.)\r<br />\n<br />\nI set up a virtual machine to test with and got TFS installed with very little difficulty (yay). Then I tried to duplicate the setup of the existing project that I want to branch. I followed the suggested advice of creating new folders to hold the branches and then I moved my Source folder into the MAIN folder, so now I have /Main/MAIN (with MAIN being converted to a branch) and /Development/DEV (MAIN branched to DEV). We have a top-level folder in the project where we store all our non-project references, i.e., assemblies that are very mature and which we reference as files instead of as projects. The addition of two new levels of folders means I have to update the relative references in my projects to go up an additional two levels. That's not really a problem; I'm not afraid of doing a little direct file manipulation to projects, and it only has to be done once.\r<br />\n<br />\nWhat does worry me, though, is that the projects contain relative references to their source control location which INCLUDE their current paths. This is hard to explain, so let me give an example. First, when I opened to solution in MAIN, Visual Studio complained that the source control references in the projects didn't appear to be correct. This is because the projects contained entries that looked like this:\r<br />\n<br />\n&lt;SccProjectName&gt;%24/MyTFSProject/Source/MyProject1&lt;/SccProjectName&gt;\r<br />\n<br />\nBut MyProject1 is no longer at that path; Visual Studio updated the tag to\r<br />\n<br />\n&lt;SccProjectName&gt;%24/MyTFSProject/Main/MAIN/Source/MyProject1&lt;/SccProjectName&gt;\r<br />\n<br />\nFine, now it knows where the project is. But then I branched MAIN to DEV. The project file was copied to the DEV file structure, and now when I open the solution from the dev hierarchy, Visual Studio again detects the discrepancy and updates the project file to this:\r<br />\n<br />\n&lt;SccProjectName&gt;%24/MyTFSProject/Development/DEV/Source/MyProject1&lt;/SccProjectName&gt;\r<br />\n<br />\nThis would be fine IF I were never going to change the project again. But we all know projects change. New classes get added (or removed) and perhaps new references are added. So if I make such a change in DEV, when I merge back (RI) into MAIN, that path is going to come right along, and then if I go to open the solution from MAIN (for building or whatnot), Visual Studio will once again complain, fix the path, and then <em>that</em> change will get FI'd to DEV, etc., etc. Is there any way around this?\r<br />\n<br />\nMaybe this sort of thing isn't an issue for developers who only ever work in the DEV branch, but I'm the guy who's going to be touching all the branches at some point, and I forsee this being a problem. A problem that none of the guides or threads I've read have mentioned at all, so either I'm doing something wrong or people just aren't talking about this.<br />\n",
    "PostedDate": "2013-11-26T11:21:40.65-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1249691",
    "ThreadId": "471231",
    "Html": "Hi Pawprint,\r<br />\n<br />\nDid you find any information since to help you with this issue as I've also noted the same issue?\r<br />\n<br />\nThanks in advance!<br />\n",
    "PostedDate": "2014-05-26T08:26:44.157-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1249711",
    "ThreadId": "471231",
    "Html": "Hi Pawprint,<br />\n<br />\n<strong>I believe I have found a Solution to the problem you have been experiencing!</strong>  The following worked for me....<br />\n<br />\nEach solution/project within each respective branch needs to have a number of project configuration settings (including the SccProjectName setting) updated to contain the value 'SAK'.<br />\n<br />\nThere are two approaches on how you can make this change.  Firstly I'll outline the recommended approach:<br />\n<strong>APPROACH 1:</strong><br />\n<ol>\n<li>Open the Solution within Visual Studio.</li>\n<li>Click on &quot;File&quot; (menu) -&gt; &quot;Source Control&quot; -&gt; &quot;Change Source Control...&quot; (sub-menu option)</li>\n<li>Within the &quot;Change Source Control&quot; dialog select each solution/project in turn and click on the Unbind option for each.</li>\n<li>Once you have unbounded all solutions/projects click OK to close the dialog.</li>\n<li>Next, repeat step 2 above.</li>\n<li>This time within the &quot;Change Source Control&quot; dialog click on the Bind option for each solution/project listed.</li>\n<li>Once you have re-bound all solutions/projects click OK to close the dialog (ensure to check out any files you are prompted to check-out).</li>\n<li>\nSave your changes and do a source control compare on one of the projects that you experienced the issue with<br />\n</li>\n</ol>\nExpected Results: - You should now see the following project configuration settings updated similar to as noted below.<br />\n<pre><code>    &lt;SccProjectName&gt;SAK&lt;/SccProjectName&gt;\n    &lt;SccProvider&gt;SAK&lt;/SccProvider&gt;\n    &lt;SccAuxPath&gt;SAK&lt;/SccAuxPath&gt;\n    &lt;SccLocalPath&gt;SAK&lt;/SccLocalPath&gt;</code></pre>\n\n<strong>APPROACH 2:</strong><br />\nAlternatively, you can achieve the same result by manually updating each affected project file but making the code changes noted above (i.e. update the value of each configuration setting to be 'SAK').  Ensure to checkout your project files in advance thought for each code branch!<br />\n<br />\nFinally, this solved the issue for me so I hope this is also of help to you or anybody else who experiences the same issue.<br />\n<br />\nGood luck!<br />\n",
    "PostedDate": "2014-05-26T09:09:16.77-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]